---
kind: property
id: P:Autodesk.Revit.UI.DockablePaneProviderData.ContextualHelp
source: html/5f5cbd6e-f62b-8133-3e32-ce5da3eef856.htm
---
# Autodesk.Revit.UI.DockablePaneProviderData.ContextualHelp Property

The contextual help associated with the pane.

## Syntax (C#)
```csharp
public ContextualHelp ContextualHelp { get; set; }
```

## Remarks
If set, the contents of this Contextual Help will be used to respond to a user request for help
 (typically this is as a result of pressing F1 while the dockable pane has focus).